---

C#Visual BasicVisual C++

Revit 2024 API
---
Application..::..NewCurveLoopsProfile Method
Application Class See Also Send Feedback
---

Creates a new CurveLoopsProfile object.

**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)

# Syntax

C#
---

    public CurveLoopsProfile NewCurveLoopsProfile(
    	CurveArrArray curveLoops
    )

Visual Basic
---

    Public Function NewCurveLoopsProfile ( _
    	curveLoops As CurveArrArray _
    ) As CurveLoopsProfile

Visual C++
---

    public:
    CurveLoopsProfile^ NewCurveLoopsProfile(
    	CurveArrArray^ curveLoops
    )

#### Parameters

curveLoops
    Type: Autodesk.Revit.DB..::..CurveArrArrayThe curve loops of the Profile.

#### Return Value

The new CurveLoopsProfile object.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | Thrown when the argument is nullNothingnullptra null reference (Nothing in Visual Basic). |

# See Also

Application Class

Autodesk.Revit.Creation Namespace